In [1]:
import pandas as pd
import numpy as np
import random

C:\Users\Isabel\AppData\Local\Temp\ipykernel_7040\605883380.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

1. ¿Qué diferencia hay entre una Serie y un DataFrame?

Serie: undidimensional.
DataFrame: bidimensional.

Crea dos listas:

Una que se llame "valores" que tenga 7 números aleatorios.

Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [3]:
valores = [random.randint(1,20) for _ in range(7)]

indices = ['Lun', 'Mar', 'Mie', 'Jue', 'Vie', 'Sab', 'Dom']

valores

[19, 12, 16, 13, 16, 11, 5]

A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [4]:
serie = pd.Series(valores, indices)

serie

Lun    19
Mar    12
Mie    16
Jue    13
Vie    16
Sab    11
Dom     5
dtype: int64

A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez.

In [5]:
dicc = {}

for indice, valor in zip(indices, valores):
    dicc[indice] = valor

dicc

{'Lun': 19, 'Mar': 12, 'Mie': 16, 'Jue': 13, 'Vie': 16, 'Sab': 11, 'Dom': 5}

Crea una Serie con el diccionario creado en el punto anterior.

In [8]:
serie_dicc = pd.Series(dicc)

serie_dicc

Lun    19
Mar    12
Mie    16
Jue    13
Vie    16
Sab    11
Dom     5
dtype: int64

In [13]:
# ¿Qué forma tiene esta última Serie?
print('Forma: \n', serie_dicc.shape)

# ¿Qué tipo de datos tiene?
print('Tipo datos: \n', serie_dicc.dtype)
# ¿Qué tamaño tiene?
print('Tamaño: \n', serie_dicc.size)
# ¿Cuáles son los índices de la Serie?
print('Indices: \n', serie_dicc.index)
# ¿Y los values?
print('Values: \n', serie_dicc.values)

Forma:
 (7,)
Tipo datos:
 int64
Tamaño:
 7
Indices:
 Index(['Lun', 'Mar', 'Mie', 'Jue', 'Vie', 'Sab', 'Dom'], dtype='object')
Values:
 [19 12 16 13 16 11  5]

In [21]:
# Extrae el valor para el índice "lunes"
print('Valor de Lun:', serie_dicc['Lun'], '\n')

# Extrae el valor para el índice "lunes", "martes" y "miércoles".
print('Valor de lunes a miércoles: \n', serie_dicc['Lun':'Mie'], '\n')

# Extrae el valor para el índice "lunes" y "domingo".
print('Valores lunes y domingo: \n', serie_dicc[['Lun', 'Dom']])

Valor de Lun: 19

Valor de lunes a miércoles:
 Lun    19
Mar    12
Mie    16
dtype: int64

Valores lunes y domingo:
 Lun    19
Dom     5
dtype: int64

Crea un array de dos dimensiones con 4 filas y 3 columnas.

Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia"

In [23]:
array = np.random.rand(4,3).round(2)
array

array([[0.09, 0.4 , 0.42],
       [0.33, 0.43, 0.9 ],
       [0.72, 0.42, 0.37],
       [0.42, 0.71, 0.6 ]])

In [25]:
df = pd.DataFrame(array, columns=['España', 'Francia', 'Italia'])
df

   España  Francia  Italia
0    0.09     0.40    0.42
1    0.33     0.43    0.90
2    0.72     0.42    0.37
3    0.42     0.71    0.60

In [27]:
medallas = pd.read_csv('medallas.csv', index_col=0)

medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [45]:
# Usando el loc extrae todas las columnas de la fila de Tailandia.
medallas.loc[7]

# Usando el loc extrae todas las columnas de China e Irán.
medallas.loc[[1,4]]

# Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.
medallas.loc[:, ['Oro', 'Plata', 'Bronce']]

# Usando el iloc extrae la información de la India. Devolved todas las columnas.
medallas.iloc[5]

# Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.
medallas.iloc[1::2, :]

# Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".
medallas.iloc[1::2, 1::]

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235

In [46]:
medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [58]:
# ¿Qué país consiguió más de 200 medallas de oro?
    # OPCIÓN A
medallas.loc[medallas.Oro > 200, 'País']
    # OPCIÓN B
medallas.loc[(medallas["Oro"] > 200), 'País']

# ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
medallas.loc[(medallas["Oro"] > 200)&(medallas['Plata'] > 1000), 'País']

# ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?
medallas.loc[(medallas["Oro"] > 200) | (medallas['Bronce'] > 700), 'País']

1            China
2            Japón
3    Corea del Sur
Name: País, dtype: object

Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [60]:
medallas['Total'] = medallas.Oro + medallas.Plata + medallas.Bronce

medallas

               País   Oro  Plata  Bronce  Total
1             China  1473    994     720   3187
2             Japón  1032   1037     985   3054
3     Corea del Sur   745    663     827   2235
4              Irán   179    181     197    557
5        Kazajistán   155    158     224    537
6             India   154    202     315    671
7         Tailandia   132    175     278    585
8         Indonesia   112    131     240    483
9      China Taipéi    99    144     276    519
10  Corea del Norte    91    120     235    446